app/controllers/galleries_controller.rb

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)

  def create
    @gallery = current_user.galleries.build(params[:gallery])
    if @gallery.save
---
INSERT INTO "galleries" ("name", "updated_at", "user_id", "created_at") VALUES('Title', '2008-11-04 09:10:08', 1, '2008-11-04 09:10:08')