app/controllers/photos_controller.rb

  def index
    if @gallery.nil?
      @photos = Photo.find(:all, :order => "created_at DESC", :limit => 5)
    else
      @photos = @gallery.photos.paginate :per_page => 50, :page => params[:page], :order => "created_at DESC"
---
SELECT * FROM "photos" WHERE ("photos".gallery_id = 1) ORDER BY created_at DESC LIMIT 50 OFFSET 0
SELECT * FROM "photos" ORDER BY created_at DESC LIMIT 5

  def create
    @photo = if @gallery
      @gallery.photos.build(params[:photo])
    else
      Photo.new(params[:photo])
    end

    if @photo.save
---
INSERT INTO "photos" ("gallery_id", "updated_at", "title", "file_content_type", "file_file_name", "file_file_size", "description", "user_id", "created_at") VALUES(1, '2008-11-04 09:18:30', 'Title', 'image/jpeg', 'DSCF4699.JPG', 2092554, NULL, NULL, '2008-11-04 09:18:30')

  def find_gallery
    @gallery = Gallery.find(params[:gallery_id]) unless params[:gallery_id].nil?
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)

  def find_photo
    @photo = if @gallery.nil?
      Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1 AND ("photos".gallery_id = 1))